if InTeam(35) == false then goto label0 end;
    Talk("干你媽，這憑顆爛石頭就想阻擋我的去路嗎，看老子的厲害!", 0, 0);
    Talk("就這樣堵住我們的生路，成昆真他媽的陰險。", 110, 0);
    Talk("這個石門就交給我來推倒，喝。", 35, 0);
    Talk("恩，待我觀來。令狐施主，要化解你體內的真氣不難，但因這幾道真氣在你體內造成你的經脈受損，因此只有易筋伐髓，重塑經脈，方可醫治。兇險非常。只是易筋伐髓之時，腦中異像紛亂，只有斷絕雜念，放下執著，方可渡此難關。", 110, 0);
    DarkScence();
    ModifyEvent(-2, -2, -2, -2, 1182, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(30, 0, -2, -2, 302, -1, -1, -2, -2, -2, -2, -2, -2);
    LightScence();
    Talk("一切但憑神僧差遣，我令狐沖乃江湖浪蕩子一個 生死由天，就算中間出了什麼差錯，我令狐沖也絕不會有任何一句怨言。", 35, 0);
    AddMaxHP(35, 600);
    AddMaxMP(35, 500);
    AddAttack(35, 20);
    exit();
::label0::
    Talk("阿彌陀佛", 0, 0);
exit();
