if InTeam(28) == true then goto label0 end;
    exit();
::label0::
    Talk("少俠別來無恙?", 63, 0);
    Talk("一樣沒啥進展。", 122, 0);
    Talk("需要勞煩周姑娘的幫忙了。", 63, 0);
    Talk("師妹，你勾結魔叫妖人害死師父，你居然還敢上來峨嵋。", 122, 0);
    Talk("丁師姐，我沒有勾結魔教妖人害死師父，師父還將掌門傳給了我。", 63, 0);
    Talk("你是本門最年輕的弟子，論資望，說武功，哪一樁都輪不到你來做本派掌門…將師父的玄鐵指環交出來!", 0, 0);
    if TryBattle(20) == true then goto label1 end;
        Dead();
        exit();
::label1::
        ModifyEvent(-2, 0, 0, -2, -1, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 1, 0, -2, -1, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 3, -2, -2, 151, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 4, -2, -2, 151, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 5, -2, -2, 151, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 6, -2, -2, 151, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 7, -2, -2, 151, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 8, -2, -2, 151, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 9, -2, -2, 151, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 10, -2, -2, 151, -1, -1, -2, -2, -2, -2, -2, -2);
        LightScence();
        Talk("這掌門鐵指環，你不交也得交！", 63, 0);
        Talk("我受先師之命，接任本派掌門，這鐵指環決不能交。我實在不想當這掌門，可是我曾對師父立下重誓，決不能……決不能有負她老人家的托付。", 0, 0);
        Talk("．．．．．．", 122, 0);
exit();
