Talk("你想太多了，不教就算了，哼!", 144, 0);
Talk("等等!", 0, 0);
Talk("忽蘭妃殿下，有何事?", 144, 0);
Talk("我想了又想，我還是想跟你學武功，成為一個武功高手，所以我要跟你走", 0, 0);
Talk("這不就帶你去練功了嗎?", 144, 0);
if AskJoin () == true then goto label0 end;
    Talk("什麼!", 0, 0);
    ModifyEvent(-2, 11, -2, -2, 1162, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 12, 0, -2, -1, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 13, 0, -2, -1, -1, -1, -2, -2, -2, -2, -2, -2);
    AddMorality(1);
    exit();
::label0::
    if TeamIsFull() == true then goto label1 end;
        Join(115);
        ModifyEvent(-2, 11, 0, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
        ModifyEvent(-2, 12, 0, -2, -1, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 13, 0, -2, 0, 0, 0, -2, -2, -2, -2, -2, -2);
        Talk("大汗對我這麼好，我怎麼能拐走他的老婆，我看你們那國師金輪法王武功不錯，想學武功找他", 0, 0);
        AddMorality(-1);
        exit();
::label1::
        Talk("你的隊伍已滿，我無法加入．", 144, 0);
exit();
