if InTeam(38) == false then goto label0 end;
    Talk("石中玉?好大的膽子，在雪山派干下如此惡行還敢回來?", 28, 0);
    AddItem(132, 1);
    Talk("出了什么事？石中玉!你這逆徒居然還敢上雪山派!", 0, 0);
    Talk("我叫狗雜種，我不是石中玉．", 124, 0);
    if InTeam(49) == false then goto label1 end;
        Talk("這擺明是要你當替死鬼去俠客島受死，你還接下這賞罰令", 49, 0);
::label1::
        Talk("．．．．．．", 0, 0);
        ModifyEvent(-2, -2, -2, -2, 1220, -2, -2, -2, -2, -2, -2, -2, -2);
        ModifyEvent(39, 0, -2, -2, 339, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(39, 1, -2, -2, 339, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(39, 2, -2, -2, 339, -1, -1, -2, -2, -2, -2, -2, -2);
        exit();
::label0::
        Talk("老子沒空，掰!", 28, 0);
exit();
