if InTeam(49) == true then goto label0 end;
    exit();
::label0::
    Talk("師姐!別躲了，我知道你在這，快出來!", 109, 0);
    Talk("這死賤人，居然趁我修練唯我獨尊功時偷襲我，好在現在我已經修練完成，現在就去宰了那個賤人!", 15, 1);
    Talk("干!小蘿莉怎麼變老太婆了!", 49, 5);
    Talk("大膽!要不是看在你是師兄的傳人，并且幫助我的天山童姥份上，我早就殺了你這個小和尚，如今我唯我獨尊功大成，我現在先去解決那個妖婦，在這靈鷲宮好好呆著。", 15, 1);
    Talk("歐陽克這個雜碎，這麼小的小孩也吃的下去。", 0, 0);
    Talk("SOD就是需要歐陽克這種人才，哈哈!", 49, 5);
    ModifyEvent(-2, -2, 0, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 10, 0, -2, -1, -1, 1224, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 11, 0, -2, -1, -1, 1224, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 12, 0, -2, -1, -1, -1, 6572, 6572, 6572, -2, -2, -2);
    ModifyEvent(-2, 13, 0, -2, -1, -1, -1, 6574, 6574, 6574, -2, -2, -2);
exit();
