SubMapViewFromTo(32, 33, 32, 24);
Talk("．．．．魔教以火為圣，尊火為神．．．．． ．魔教自從第三十三代教主陽頂天突然死去，不及指定繼承之人．教中左右光明使者，四大護教法王，五散人，誰都覬覦這教主之位．於是自相殘殺爭奪，魔教從此中衰．這也正是六大門派合當興旺　，妖邪數該覆滅的時候了．倘若魔教不起內哄，要想挑了這批妖孽，倒也是大大的不易呢．六大派這次進剿光明頂，志在必勝，眾妖邪即便是齊心合力，咱們又有何懼？只是相斗時損傷必多，各人須得先心存決死之心，不可意圖僥幸，心有畏懼，臨敵時墮了峨嵋派的威風．俗語說的好”千棺從門出，其家好興旺．子存父先死，孫在祖乃喪．”人孰無死？只須留下子孫血脈，其家便是死了千百人，仍能興旺．最怕的是你們都死了，老尼我卻孤伶伶的活著．嘿嘿，但縱是如此，亦不足惜．百年之前，世上又有什麼峨嵋派．只須大夥兒轟轟烈烈的死戰一場，峨嵋派縱一舉覆滅，又豈足道哉？", 6, 0);
Talk("弟子誓決死戰，與妖魔邪道勢不兩立．", 77, 0);
Talk("無恥小徒，你偷聽夠了沒！", 6, 0);
if TryBattle(158) == true then goto label0 end;
    LightScence();
    Talk("倚天劍，果然名不虛傳！需得上光明頂通知大伙，六大派要來找麻煩了。", 14, 0);
    ModifyEvent(-2, 0, -2, -2, -1, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 1, -2, -2, -1, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 11, -2, -2, -1, -1, 147, -2, -2, -2, -2, -2, -2);
exit();
::label0::
    LightScence();
    Talk("倚天劍，果然名不虛傳！滅絕，后會有期。我在光明頂上等你。只是不知你有沒有命來。哈哈！", 14, 0);
    ModifyEvent(-2, 0, -2, -2, -1, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 1, -2, -2, -1, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 11, -2, -2, -1, -1, 147, -2, -2, -2, -2, -2, -2);
exit();
