Talk("見性峰乃恒山派禁地，施主勿近．", 83, 0);
if AskBattle() == true then goto label0 end;
    exit();
::label0::
    Talk("什麼恒山派禁地，土地權狀拿出來我瞧瞧．像你們這樣據地稱王的人，我最痛恨了．", 0, 1);
    Talk("這位施主，再不離開，可別怪我們不客氣！", 83, 0);
    Talk("我從地理課本上知道，恒山風光明媚，鳥語花香，而見性峰更是如人間仙境．因此我特地上來觀光的，你們這些臭道姑太不講道理了．老子我就偏要看看這見性峰到底長什麼樣！你們能奈我何！", 0, 1);
    Talk("小子說什麼！我看你是嵩山派派來的奸細吧！快滾回去告訴你們掌門，恒山派絕不會答應并派的！", 83, 0);
    Talk("說什麼五四三的，聽嘸啦．寧杯我都甘愿冒著”一見尼姑，逢賭必輸”的大險來到你們這尼姑庵中，怎可敗興而歸．", 0, 1);
    Talk("女兒，我們來幫你．", 18, 0);
    Talk("……", 17, 1);
    Talk("爹，娘。", 83, 0);
    if TryBattle(23) == true then goto label1 end;
        Dead();
        exit();
::label1::
        ModifyEvent(-2, 2, -2, -2, 169, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 3, -2, -2, 169, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 4, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
        ModifyEvent(-2, 5, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
        ModifyEvent(-2, 6, -2, -2, 169, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 7, -2, -2, 169, -1, -1, -2, -2, -2, -2, -2, -2);
        LightScence();
        Talk("哼！愈是不讓我來，我就愈想探個究竟．", 0, 1);
        AddFame(1);
exit();
