Talk("小子，你擅闖我衡山，是何用意？莫非是左冷禪派來的奸細．", 20, 0);
if TryBattle(28) == true then goto label0 end;
    Dead();
    exit();
::label0::
    ModifyEvent(-2, -2, -2, -2, 191, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 19, -2, -2, -1, -1, 222, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 21, -2, -2, -1, -1, 222, -2, -2, -2, -2, -2, -2);
    ModifyEvent(27, 0, -2, -2, -1, -1, 202, -2, -2, -2, -2, -2, -2);
    LightScence();
    Talk("回去告訴左冷禪，下月十五在嵩山召開的大會，我莫大一定到場．我倒要看看其它三派的掌門怎麼說．", 20, 0);
    AddFame(3);
exit();
