Talk("上次多虧了少俠的幫忙，才阻止了左冷禪的陰謀．這回，岳某忝為”五岳派”的掌門，其肩上的責任是更重大了．不過岳某一定盡力以赴，率領五岳派打倒日月魔教．", 19, 0);
CheckSubMapPic(56, 1, 5862, 0, 2);
    exit();
::label0::
    if InTeam(36) == false then goto label1 end;
        exit();
::label1::
        Talk("……對了，林公子在嗎？", 0, 1);
        Talk("他已同小女成了親，現在是我女婿。平之……", 19, 0);
        Talk("原來是公子你啊！你總算來了。", 36, 1);
        Talk("哈哈，你有了新婚妻子還會想我？", 0, 0);
        Talk("哼，你可知我這些日子來忍辱負重，過的是什么樣的日子？", 36, 1);
        Talk("怎么，岳先生待你不好？他可是連自己的寶貝女兒都嫁給你了。", 0, 0);
        Talk("這你就有所不知了。初時我也對他萬分感激，但原來他才是真正的卑鄙小人，偽君子。", 36, 1);
        Talk("你怎么這么說？他畢竟是你的岳父啊！", 0, 0);
        Talk("哼！你當他收我為徒，傳我武功，都是對我好嗎？他甚至肯把女兒嫁給我，還不就是為了我家的《辟邪劍譜》。", 36, 1);
        Talk("難道還真有劍譜？", 0, 0);
        Talk("岳不群處心積慮，為的就是要得到劍譜。余滄海等人明搶，還不失為真小人。他倒好老謀深算，十足一個偽君子。", 36, 1);
        Talk("竟然會有此等事情！？", 0, 0);
        Talk("我現在打算上青城派報仇，你愿不愿助我一臂之力？當然好處少不了你的。", 36, 1);
        if AskJoin () == true then goto label2 end;
            Talk("林公子，我怕我幫不了你。", 0, 0);
            exit();
::label2::
            Talk("咱們是兄弟，還談什么好不好處。", 0, 0);
            if TeamIsFull() == true then goto label3 end;
                Talk("這就走吧。", 36, 1);
                DarkScence();
                ModifyEvent(36, 4, -2, -2, 296, -1, -1, -2, -2, -2, -2, -2, -2);
                SetRoleMagic(36, 0, 60, 900);
                LightScence();
                AddMaxHP(36, 200);
                AddAttack(36, 30);
                AddMaxMP(36, 200);
                AddSpeed(36, 50);
                SetSexual(36, 2);
                Join(36);
exit();
::label3::
                Talk("你隊伍已滿，我無法加入。", 36, 0);
exit();
