if InTeam(29) == false then goto label0 end;
    Talk("當然，這是我為了破解你的快刀所想出來的劍招．", 29, 0);
    Talk("好，華山令狐沖，我當你是一號人物，這小尼姑我就放過她．", 81, 0);
    ModifyEvent(-2, 2, -2, -2, 192, -2, -2, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 3, -2, -2, 192, -2, -2, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 4, -2, -2, 192, -2, -2, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 5, -2, -2, 192, -2, -2, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 6, -2, -2, 192, -2, -2, -2, -2, -2, -2, -2, -2);
    ModifyEvent(81, 0, -2, -2, -2, -2, 283, -2, -2, -2, -2, -2, -2);
    exit();
::label0::
    Talk("聽說日月魔教的教主東方不敗武功高強，但我五岳劍派連成一氣，定能瓦解魔教．", 81, 0);
exit();
