Talk("下月十五的嵩山大會上，岳某將盡力而為．", 19, 0);
Talk("到時我一定去幫你．", 0, 1);
if InTeam(35) == false then goto label0 end;
    Talk("是啊，師父，到時我們一定會去幫你．", 35, 1);
::label0::
    if InTeam(36) == false then goto label1 end;
        Talk("啊，林公子你這是干什么？", 0, 0);
        Talk("弟子一見師父，便說不出的欽佩敬仰。求師父收錄門墻，弟子一定恪守教誨，嚴守門規。", 36, 1);
        Talk("本來收你為徒不難，但近來江湖中，你林家劍譜的事鬧得沸沸揚揚。我現在若收你恐怕落人話柄，遭人口食。", 19, 0);
        Talk("這……", 36, 1);
        Talk("唉，岳先生，此言差已。有道是君子坦蕩蕩，你既為“君子劍”怎可明哲保身，而不顧我林兄弟一片誠意。", 0, 0);
        Talk("爹，這位少俠說得有理。更何況這小林子也實在可憐，不如你就……", 126, 1);
        Talk("我自有主張。好吧，我就收下你了。", 19, 0);
        Talk("謝師父！也謝謝師姐。", 36, 1);
        Talk("恭喜你，林公子！今日得遇名師，前途自當無可限量。兄弟我要走了，你自己保重我會回來看你的。", 0, 0);
        LeaveTeam(36);
        ModifyEvent(27, 61, 1, -2, 214, -1, -1, 5958, 5958, 5958, -2, -2, -2);
exit();
::label1::
exit();
