if HaveItemBool(79) == true then goto label0 end;
    if InTeam(29) == false then goto label1 end;
        Talk("當然，這是我為了破解你的快刀所想出來的劍招．", 29, 0);
        Talk("好，華山令狐沖，我當你是一號人物，這小尼姑我就放過她．", 81, 0);
        ModifyEvent(-2, 2, -2, -2, 725, -2, -2, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 3, -2, -2, 725, -2, -2, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 4, -2, -2, 725, -2, -2, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 5, -2, -2, 725, -2, -2, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 6, -2, -2, 725, -2, -2, -2, -2, -2, -2, -2, -2);
        ModifyEvent(81, 0, -2, -2, -2, -2, 283, -2, -2, -2, -2, -2, -2);
        exit();
::label1::
        Talk("師父說我華山派從今日起，在我五岳派中所負的責任是更重大的．我們要好好練武，過些時候好攻上黑木崖，消滅萬惡的日月魔教．", 81, 0);
        exit();
::label0::
        Talk("師父說我華山派從今日起，在我五岳派中所負的責任是更重大的．我們要好好練武，過些時候好攻上黑木崖，消滅萬惡的日月魔教．", 81, 0);
exit();
