Talk("好啊，你們居然在這里計劃要殺人，虧你們還是同盟的幫派．", 0, 1);
Talk("小子，偷聽了我們的計劃，只好殺了你滅口．怪不得我們了．上！", 54, 0);
Talk("賊子，休得猖狂。沒想到你們嵩山派行事比我們神教還狠。", 34, 0);
if TryBattle(42) == true then goto label0 end;
    Dead();
    exit();
::label0::
    ModifyEvent(-2, 14, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 15, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 16, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    LightScence();
    Talk("多謝相助，敢問前輩尊姓大名？", 0, 0);
    Talk("不瞞小兄弟，在下日月教曲洋。我與劉賢弟真心相交，以樂會友。不想卻惹出這么多是非，真不知我們何時才能真正的笑傲江湖。我去了，今日之事多謝相助，曲某日后圖報……", 34, 1);
    Talk("其實，魔教也不都是壞人，正派也有像費彬這樣的卑鄙小人，咦，怎麼從曲前輩身上掉下一本書。", 0, 0);
    AddItem(81, 1);
    Talk("前輩，你的東西掉了，前輩!走的還真快，這本書是隨處可見的莊子，我看也沒什麼。", 0, 0);
    AddMorality(3);
    AddFame(1);
exit();
