if isUsingItem(180) == true then goto label0 end;
    exit();
::label0::
    Talk("啊！這是北宋范寬的真跡”谿山行旅圖”，你．．．你是從何處得來的？", 31, 0);
    Talk("這個你不必管．我聽江湖上傳言，梅莊四莊主好酒，好畫，好劍，人稱三絕，那想必武功也是不錯了，在下浪跡江湖只為尋找一個可敗我的敵手，只要四莊主或莊中任何一個人能夠打敗我，此畫雙手奉上．", 0, 1);
    Talk("你這小子，到底有什麼企圖？", 31, 0);
    Talk("”企圖”沒有，只要打贏我這幅畫就是你的．", 0, 1);
    Talk("小子，打贏你你可不能反悔．", 31, 0);
    Talk("還肖想想打贏我？我看幫我搔癢還差不多．", 0, 1);
    Talk("膽敢小看我！氣死我了！", 31, 0);
    if TryBattle(43) == true then goto label1 end;
        Dead();
        exit();
::label1::
        LightScence();
        Talk("真是長江後浪推前浪，今日敗在你的手里，我也沒話可說．", 31, 0);
        Talk("承讓了，四莊主．", 0, 1);
        Talk("小子，你說莊中只要有人能打敗你就可以拿到那幅畫吧!你等著，待我去請我三哥．", 31, 0);
        DarkScence();
        ModifyEvent(-2, 3, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
        SetSubMapLayerData(-2, 1, 37, 42, 0);
        ModifyEvent(-2, 8, 1, 1, 253, -1, -1, 6048, 6048, 6048, -2, -2, -2);
        LightScence();
        AddFame(2);
exit();
