Talk("像你這等見識，才配品嘗我莊中所釀的美酒，我丹青生先乾為敬!", 0, 0);
if InTeam(49) == true then goto label0 end;
    exit();
::label0::
    if HaveItemBool(128) == true then goto label1 end;
        Talk("不瞞四莊主，聽說梅莊四莊主乃書畫大家，我旁邊這位朋友因緣巧合得到一幅畫，希望四莊主能幫我監定。", 49, 0);
        Talk("．．．．．．", 0, 0);
        exit();
::label1::
        Talk("不瞞四莊主，聽說梅莊四莊主乃書畫大家，我旁邊這位朋友因緣巧合得到一幅畫，希望四莊主能幫我監定。", 49, 0);
        Talk("小和尚，你手上的七寶指環是哪來的？", 183, 1);
        Talk("給葛格親一下我就告訴你。", 49, 0);
        Talk("媽的你是羅莉控嗎?小妹妹，你家在哪?我帶你離開這個淫窟。", 0, 0);
        Talk("我家在靈鷲宮，快告訴我，你怎麼有這枚戒指。", 183, 0);
        Talk("就是一個叫無涯子的老頭臨終前交給我的，還逼我做他徒弟，妹妹想要啊?反正這戒指沒屁用，要拿就拿去。", 49, 0);
        Talk("什么！你說無涯子死了？還有這戒指真的要給我．．．快帶本姥．．．帶我回靈鷲宮好嗎?", 183, 0);
        Talk("別擔心，鄉民是正義又熱心的，我就帶你走吧!", 0, 0);
        AddItemWithoutHint(128, -1);
        ModifyEvent(-2, -2, 0, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
        ModifyEvent(66, 14, 0, -2, -1, -1, 1223, -1, -1, -1, -2, -2, -2);
exit();
