if InTeam(38) == false then goto label0 end;
    Talk("貝海石居居副幫主之位，一直不肯就任幫主，大概跟俠客島的善惡賞罰使近來出現在江湖有關．", 90, 0);
    Talk("媽的，石中玉這狗東西，知道我拱他當幫主是為了幫我擋善惡賞罰令，居然給我逃了，怎摩辦?難道要我拿這善惡賞罰令去俠客島找死。", 58, 0);
    Talk("為了應付善惡賞罰使的到來 師父和師叔都在閉關中 少俠請回吧!", 124, 0);
    if TryBattle(58) == true then goto label1 end;
        Dead();
::label1::
        ModifyEvent(-2, 0, 0, 0, -1, -1, 344, -1, -1, -1, -2, -2, -2);
        ModifyEvent(-2, 1, 0, 0, -1, -1, 344, -1, -1, -1, -2, -2, -2);
        ModifyEvent(-2, 2, 0, 0, -1, -1, 344, -1, -1, -1, -2, -2, -2);
        LightScence();
        exit();
::label0::
        Talk("來者何人，可知這里是凌霄城．", 90, 0);
        Talk("小弟有事想求見貴派掌門．", 0, 1);
        Talk("掌門師叔現下不見客．", 90, 0);
        Talk("在下并無惡意，煩請這位大哥通報一聲．", 0, 1);
        Talk("出了什么事？", 58, 0);
        Talk("封師叔，此人要求見掌門。", 90, 1);
        Talk("本派今有大事要辦，快快離去，別在這羅嗦．", 58, 0);
        if AskBattle() == true then goto label2 end;
            exit();
::label2::
            Talk("閣下莫非是“風火神龍”封萬里？實在對不起，在下一定得見見貴派掌門．", 0, 1);
            Talk("既然識的封某還想硬闖？真當我是廢人不成！", 58, 0);
            if TryBattle(58) == true then goto label3 end;
                Dead();
                exit();
::label3::
                ModifyEvent(-2, 0, 0, 0, -1, -1, 344, -1, -1, -1, -2, -2, -2);
                ModifyEvent(-2, 1, 0, 0, -1, -1, 344, -1, -1, -1, -2, -2, -2);
                ModifyEvent(-2, 2, 0, 0, -1, -1, 344, -1, -1, -1, -2, -2, -2);
                LightScence();
                Talk("封前輩，對不住了。在下實在無意冒犯，還請見諒。", 0, 0);
                Talk("少廢話，封某既然敗了，無話可說……唉，難道我真得不行了！", 58, 1);
                AddFame(1);
exit();
