if HaveItemBool(69) == true then goto label0 end;
    exit();
::label0::
    Talk("沒想到本府還沒派人抓你，你倒自己送上門來．", 176, 1);
    WalkFromTo(19, 45, 9, 42);
    Talk("干，認錯人了吧，我是個守法的好公民，為啥要抓我．", 0, 0);
    Talk("大膽，本府經過查證，你和天地會反賊陳近南交從甚密，速將陳近南下落說出，本府還能饒你一條狗命．", 176, 1);
    Talk("寧杯是認識陳近南拉，怎樣?來抓我啊!來打我啊!哈哈．", 0, 0);
    Talk("本府知道你武功高強，如果本府沒有準備，怎麼會打草驚蛇呢?你不覺得你一進來後，有股特別奇怪的香味嗎?告訴你，這就是我特別用來對付你金波旬花的香味", 176, 1);
    Talk("干，又要暈了．", 0, 0);
    PlayAnimation(-1, 5994, 6012);
    DarkScence();
    OldSetScencePosition(9, 28);
    ZeroAllMP();
    ModifyEvent(-2, 11, 0, -2, -1, -1, -1, -2, -2, -2, -2, -2, -2);
    LightScence();
    PlayAnimation(-1, 6026, 6036);
    Talk("你娘的，被關進來了，媽的還內力盡失，看來這牢飯吃定了，先去跟旁邊的大哥拜一下碼頭，我可不想成為監獄風云的主角．", 0, 0);
exit();
