ModifyEvent(-2, -2, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
AddItem(134, 1);
Talk("吧它給我。", 2, 1);
Talk("你是誰，我憑什么要聽你的？", 0, 1);
Talk("你去問閻王爺吧！", 2, 0);
if TryBattle(146) == true then goto label0 end;
    Dead();
    exit();
::label0::
    LightScence();
    Talk("哦，可這惡道姑是誰啊？斷腸草只有一株嗎....", 0, 0);
    ModifyEvent(44, 13, 0, -2, -1, -1, 1034, -2, -2, -2, -2, -2, -2);
    ModifyEvent(44, 14, 0, -2, -1, -1, 1034, -2, -2, -2, -2, -2, -2);
    ModifyEvent(44, 15, 0, -2, -1, -1, 1034, -2, -2, -2, -2, -2, -2);
    ModifyEvent(44, 16, 0, -2, -1, -1, 1034, -2, -2, -2, -2, -2, -2);
exit();
