Talk("二妹，看來那李莫愁不會善罷甘休，就暫時跟大哥一起走吧!", 136, 0);
Talk("姑娘沒事吧!那李莫愁從不講理，我也有吃過他的虧．", 0, 1);
Talk("程英謝公子關心．", 136, 0);
Talk("姑娘被李莫愁傷到腳?腳怎麼有點跛．", 0, 1);
Talk("看在你是大哥朋友的份上告訴你，你敢再看我的腳我就挖出你的眼睛．", 136, 0);
Talk("三妹李莫愁可能還在附近，跟我們一起走比較安全．", 0, 1);
Talk("傻．．．大哥．．．這本五毒秘傳你先拿去吧，背熟後趕緊燒了它．", 136, 0);
Talk("原來姑娘是東邪黃藥師的高徒，那武功一定不錯了．", 0, 1);
Talk("那里，我資質太差，沒能學到師父武功的精髓，只學會一些奇門五行之術．", 136, 0);
Talk("干，這個床還真冰，難道這就是傳說中的寒玉床．", 0, 1);
Talk("都快冷死了還躺下去睡，我瘋了嗎?", 136, 0);
ModifyEvent(-2, -2, -2, -2, 403, -1, -1, -2, -2, -2, -2, -2, -2);
if AskJoin () == true then goto label0 end;
    Talk("打擾姑娘多時，在下告退．", 0, 1);
    exit();
::label0::
    Talk("那程姑娘可否與在下一游，幫忙在下尋找那十四天書？", 0, 1);
    if InTeam(58) == true then goto label1 end;
        Talk("對不起，我要等我大哥。", 136, 0);
        exit();
::label1::
        Talk("媽的，這小白臉居然跑到我家來嫖我老婆，他奶奶的，這綠帽子戴的可大了，看我用蒙汗藥迷昏你們，再搜括你身上的銀兩銀票。", 136, 0);
        Talk("小賊，想對我們家公子做什麼?", 118, 1);
        Talk("奇怪……公子怎麼暈了過去，怎麼連我馮錫范也感到昏昏沉沉，尋常的蒙汗藥怎麼可能迷的倒我……", 136, 0);
        Talk("奇怪，怎麼今天我的蒙汗藥這麼有效。", 118, 1);
        if TeamIsFull() == false then goto label2 end;
            Talk("你的隊伍已滿，我無法加入．", 136, 0);
            exit();
::label2::
            Talk("呵呵，小娃娃，要不是我幫你加點料，憑你的蒙汗藥怎麼可能迷倒像馮錫范這樣內力深厚的高手。", 136, 0);
            AddItem(46, 1);
            DarkScence();
            ModifyEvent(-2, -2, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
            LightScence();
            Join(63);
            AddMorality(2);
exit();
