Talk("這位小哥，我初到此地，不知這附近有那里好玩的．", 0, 1);
Talk("我聽人家說，西去有個無量山，風景清幽．", 138, 0);
Talk("不知兄臺如何稱呼?", 0, 1);
Talk("在下姓段，單名一個譽字．", 138, 0);
Talk("看你年紀輕輕就到江湖上游歷，藝高人膽大，想來出生在武林世家，武功必定不弱．", 0, 1);
Talk("我家確實有武功”一陽指” ，只是我不太想學．", 138, 0);
Talk("這武功聽起來好像很厲害的樣子，你為什麼不肯學，是怕辛苦嗎？", 0, 1);
Talk("辛苦我才不怕呢．我從小受了佛戒，這十多年來，我學的都是儒家的仁人之心，推己及人．佛家的戒殺戒嗔，慈悲為懷．忽然爹爹要我練武，學打人殺人的法子，我自然覺得不對頭．", 138, 0);
Talk("可是如果你不會武功，看見有人被欺負，而你又想救他時，怎麼辦？", 0, 1);
Talk("那我會大大的曉諭他一番，不許他們這樣胡亂殺人．要知冤家宜解不宜結，何況兇殺斗狠，有違國法，若叫官府知道，大大的不妥．", 138, 0);
Talk("＜這小子似乎有點秀逗＞", 0, 1);
ModifyEvent(-2, 0, -2, -2, 477, -2, -2, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 8, -2, -2, 477, -2, -2, -2, -2, -2, -2, -2, -2);
if AskJoin () == true then goto label0 end;
    Talk("好了，不打擾兄臺了．他日有緣，再一同游山玩水吧．", 0, 1);
    exit();
::label0::
    if CheckRoleMorality(0, 40, 100) == true then goto label1 end;
        Talk("嗯．．．我還有些事要辦，恐怕無法與閣下同行．", 138, 0);
        exit();
::label1::
        if TeamIsFull() == false then goto label2 end;
            Talk("你的隊伍已滿，我無法加入．", 138, 0);
            exit();
::label2::
            Talk("好啊，有個人做伴，路上也有個照應．", 138, 0);
            DarkScence();
            ModifyEvent(-2, 0, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
            ModifyEvent(-2, 8, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
            LightScence();
            Join(53);
exit();
