if InTeam(56) == true then goto label0 end;
    Talk("幫主不在幫中，閣下請回吧!", 94, 0);
    exit();
::label0::
    Talk("來者何人，擅闖我鐵掌山．", 94, 0);
    Talk("鐵掌山？我還以為是”猴爪山”呢？", 0, 1);
    Talk("大膽狂徒，竟敢上我鐵掌幫找碴．讓你知道我“鐵掌水上飄”的利害。", 67, 0);
    if TryBattle(70) == true then goto label1 end;
        Dead();
        exit();
::label1::
        ModifyEvent(-2, 2, -2, -2, 449, -1, -1, 6092, 6092, 6092, -2, 27, 47);
        ModifyEvent(-2, 3, -2, -2, 449, -1, -1, 6098, 6098, 6098, -2, 30, 47);
        ModifyEvent(-2, 4, -2, -2, 449, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 5, -2, -2, 449, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 6, -2, -2, 449, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 7, -2, -2, 449, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 8, -2, -2, 449, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 9, -2, -2, 449, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 10, -2, -2, 449, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 11, -2, -2, 449, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 20, 0, -2, -1, -1, 715, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 21, 0, -2, -1, -1, 715, -2, -2, -2, -2, -2, -2);
        LightScence();
        Talk("嗚，肚子突然痛了起來，今日老子就大發慈悲放你們一馬。", 67, 0);
        Talk("老梗，你這招地球的英雄撒旦都不知道用過幾變了。", 0, 5);
        Talk("大哥，原來這裘千仞是徒有虛名，真是聞名不如見面，下一次再遇到看我怎麼戲弄他。", 137, 1);
        AddFame(1);
exit();
