if InTeam(35) == false then goto label0 end;
    Talk("盈盈!", 35, 0);
    Talk("沖哥，我是來跟你道別的，咱們暫且分手，待爹爹大事已定，我再來見你。", 153, 0);
    Talk("你去黑木崖嗎？我和你同去。", 35, 0);
    Talk("好，你肯和我同去，我代爹爹多謝了。我爹爹說過，你既不允入教，他去奪回教主之事，便不能要你相助，可是……可是……", 153, 0);
    Talk("丁大俠，你不忙走，還是將那劍訣說了出來，我便給解藥于你，免得枉自送了性命，否則休怪刀下無眼。", 35, 0);
    Talk("我爹爹得你相助，心中也一定挺歡喜的。", 153, 0);
    Talk("正妹威力就是那麼大，要是今天求他的是一個丑女，令狐沖會這麼乾脆不思考就答應，他奶奶的．", 0, 0);
    ModifyEvent(26, 82, -2, -2, 316, -2, -2, -2, -2, -2, -2, -2, -2);
    exit();
::label0::
    Talk("．．．．．．", 153, 0);
exit();
