if InTeam(35) == true then goto label0 end;
    Talk("令狐兄弟呢?", 1, 0);
    exit();
::label0::
    Talk("令狐兄弟，圣姑有些話想對你說．", 1, 0);
    Talk("向兄弟，任教主目前情況怎樣，有把握干掉東方不敗嗎?", 0, 0);
    Talk("這些日子來，我和教主聯絡教中舊人，竟出乎意料之外的容易。十個中倒有八個不勝之喜，均說東方不敗近年來倒行逆施，已近于眾叛親離的地步。尤其那楊蓮亭，本來不過是神教中一個無名小卒，只因巴結上東方不敗，大權在手，作威作福，將教中不少功臣斥革的斥革，害死的害死。若不是限于教中嚴規，早已有人起來造反了。那姓楊的幫著咱們干了這樁大事，豈不是須得多謝他才是。", 1, 0);
    Talk("哼 你這惡毒的老家伙 。", 0, 0);
    Talk("<我平生所學甚雜，所學武功難以到達巔峰，若是專精其中一項武學已是終身受用 ，但既然學了豈有放棄不用之理，今日我便集合各家所長，自創一門武功! >", 1, 0);
exit();
