if InTeam(50) == false then goto label0 end;
    Talk("小和尚，你怎麼看起來一附要死不活的樣子，受了重傷怎麼不找你的師門長輩醫治．", 0, 0);
    Talk("小兄弟，你看起來受了嚴重的內傷，咦，你居然是個姑娘．", 50, 0);
    Talk("喬幫主！", 178, 0);
    Talk("你不是阿朱嗎?怎麼傷成這樣?", 0, 0);
    Talk("喬幫主別笑我胡鬧，我聽說我家慕容公子到了少林寺，想去找他。那知道我好好的進寺去，守山門的那個止清和尚兇霸霸的說道，女子不能進少林寺。我跟他爭吵，他反而罵我。我偏偏要進去，而且還扮作了他的模樣，瞧他有什么法子？", 178, 0);
    Talk("<干，我怎麼被當作空氣一樣．>", 0, 0);
    Talk("<干，怎麼我要進去就一附勉強的樣子。>", 50, 0);
    if AskJoin () == true then goto label1 end;
        exit();
::label1::
        if TeamIsFull() == false then goto label2 end;
            Talk("你的隊伍已滿，我無法加入．", 178, 0);
            exit();
::label2::
            Talk("多謝你喬幫主。", 178, 0);
            DarkScence();
            ModifyEvent(-2, -2, 0, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
            ModifyEvent(-2, 25, 0, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
            ModifyEvent(-2, 26, 0, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
            ModifyEvent(51, 20, 0, -2, -1, -1, 469, -2, -2, -2, -2, -2, -2);
            ModifyEvent(51, 21, 0, -2, -1, -1, 469, -2, -2, -2, -2, -2, -2);
            LightScence();
            Join(73);
            AddItem(209, 1);
            Talk("少林神功洗髓經?我看你是拿了這本書才會被那些和尚打成重傷吧，沒死算你好運．", 0, 0);
            exit();
::label0::
            Talk("小和尚，你怎麼看起來一附要死不活的樣子，受了重傷怎麼不找你的師門長輩醫治．", 0, 0);
            Talk("．．．．．．", 96, 0);
exit();
