if AskJoin () == true then goto label0 end;
    Talk("你義父心狠手辣，可不似你這等糊涂。再說，謝大俠殺了我，豈不是正好償了你的心愿？", 9, 1);
    exit();
::label0::
    if TeamIsFull() == false then goto label1 end;
        Talk("你的隊伍已滿，我無法加入．", 194, 0);
        exit();
::label1::
        Talk("我糊涂什麼？我不愿你去見我義父。", 9, 1);
        Talk("張無忌，你這糊涂小子，你心中實在舍不得我，不肯讓我去給謝大俠殺了，是也不是？", 194, 0);
        Talk("你別羅唆！我讓你多行不義必自斃。你最好離得我遠遠的，別叫我管不住自己，送了你性命。", 9, 1);
        Talk("不用你為我擔心。", 194, 0);
        Talk("為你擔心？哼！我巴不得你死了才好。", 9, 1);
        Talk("干!我的可魯勒，媽的，眼睛都瞎了", 194, 0);
        Talk("那你快動手啊。", 9, 1);
        Talk("趙姑娘，我曾答應過你，要給你做三件事。還有幾件事未辦。你見我義父，那是非死不可。你還是走罷，待我替你辦了那兩件了，再去會我義父不遲。", 194, 0);
        Talk("你在給自己找個不殺我的原因，我知道你實在舍不得我。", 9, 1);
        Talk("就算是我不忍心，那又怎樣？", 194, 0);
        Talk("我很喜歡啊。我一直不知你是否真心待我，現下可知道了。", 9, 1);
        Talk("那你為甚麼幾次三番的來害我？你倒舍得我？", 194, 0);
        Talk("不錯，從前我確想殺你，但自從萬安寺一會之後，我若再起害你之心，我敏敏特穆爾天誅地滅，死後永淪十八層地獄，萬劫不得超生。", 9, 1);
        Talk("那為甚麼你為了一刀一劍，竟將我拋在荒島之上？", 194, 0);
        Talk("你既認定如此，我是百口難辯，只有等謝大俠、周姑娘回來，咱們四人對質明白。", 9, 1);
        Talk("你滿口花言巧語，只騙得我一人，須騙不得我義父和周姑娘。", 194, 0);
        if InTeam(49) == false then goto label2 end;
            Talk("這是你自己要去的，我義父若下毒手，我須救不得你。", 49, 5);
::label2::
            DarkScence();
            ModifyEvent(-2, -2, 0, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
            LightScence();
            Join(39);
exit();
