if InTeam(9) == true then goto label0 end;
    Talk("還有 ，教主，郡主．．．趙姑娘現在就在偏廳，她一直在光明頂，為了就是要等教主回來，好像有話想對你說．", 0, 1);
    Talk("我還沒去找她算帳，沒想到居然自己送上門來，好的很．", 194, 0);
    exit();
::label0::
    Talk("此事當真，范右使，傳令下去，明教上下立刻趕到少林寺營救謝法王．", 9, 1);
    Talk("哼，虧你還有臉來見我？", 194, 0);
    Talk("趙姑娘氣色真不錯啊!", 9, 1);
    Talk("張無忌呢？我要見他", 194, 0);
    Talk("怎麼啦？我甚麼地方得罪張大教主啦？", 9, 1);
    Talk("你要盜那倚天劍和屠龍刀，我不怪你！你將我拋在荒島之上，我也不怪你！可是可是義父雙眼失明行動不變，你卻也將他擄去并交給少林寺，似你這等狠毒的女子，當真天下少見。", 0, 5);
    if TryBattle(248) == true then goto label1 end;
::label1::
        LightScence();
        Talk("你說我盜了倚天劍和屠龍刀，是誰見來？誰說我擄走了謝老爺子并把他交給少林寺，你叫她來跟我對質。", 9, 1);
        Talk("是我！我就讓你到陰間對質去。", 0, 5);
        Talk("住手!", 9, 1);
        Talk("大哥，為啥要出手，讓我除了這個禍害。", 194, 0);
        Talk("無忌兄弟你冷靜想想，其實那天發生的事情有很多破綻，別被一時的怒氣沖昏頭。", 9, 1);
        Talk("除了她還會有誰，難道是心地善良的周姑娘嗎?", 194, 0);
        Talk("原來周姑娘心地善良，我就心如蛇蠍。張無忌，你往哪里?", 9, 1);
        Talk("我去哪跟你有甚麼相干？", 194, 0);
        Talk("你是要去少林寺救謝大俠吧，正好我有話要問謝大俠，請你帶我去見他。", 9, 1);
        Talk("我義父下手不容情，你這不是去送死？", 194, 0);
        ModifyEvent(-2, -2, -2, -2, 475, -2, -2, -2, -2, -2, -2, -2, -2);
        ModifyEvent(28, 51, 0, -2, -2, -2, 724, -2, -2, -2, -2, -2, -2);
exit();
