if InTeam(53) == false then goto label0 end;
    Talk("我雖不屬日月教，跟你卻不是外人。就算你爹爹見了我，要攆我走，我也是厚了臉皮，死賴活挨。", 0, 0);
    Talk("聽說貴教有十四天書中的其中一本書叫笑傲江湖，不知是真是假?", 158, 0);
    Talk("我教的確擁有一本十四天書，但書名我就不得而知，詳情你遇到任教主再問他吧!", 138, 0);
    Talk("嗨，小妞，請問要怎麼到燕子塢，我過不去啊!", 158, 0);
    Talk("你是誰?為何要到燕子塢?", 138, 0);
    Talk("這位姐姐，我和我朋友對慕容公子聞名已久，路經此地，特地來求見，小娘子是公子府上何人？該當如何稱呼才是？", 0, 0);
    DarkScence();
    ModifyEvent(-2, -2, -2, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 7, 1, -2, 999, -1, -1, 6086, 6086, 6086, -2, -2, -2);
    OldSetScencePosition(36, 28);
    LightScence();
    exit();
::label0::
    Talk("我雖不屬日月教，跟你卻不是外人。就算你爹爹見了我，要攆我走，我也是厚了臉皮，死賴活挨。", 0, 0);
    Talk("．．．．．．", 158, 0);
    exit();
exit();
