Talk("晚輩參見方丈．", 0, 1);
if InTeam(51) == true then goto label0 end;
    Talk("阿彌陀佛．近來江湖上已甚少聽到明教為非作歹之事，這真多虧了少俠．光明頂之役，少俠能在不殺一人下化解了武林的這場大浩劫，減少了生靈的涂炭，功勞不小，真可謂是英雄出少年．", 70, 0);
    Talk("大師過獎了．", 0, 1);
    Talk("不知此次少俠上我少林有何貴事？", 70, 0);
    Talk("大師應該有聽說吧．我正在找一些書籍，線索并　不是很多，心想少林寺乃武　林重地，於是就到這兒來找　找看。", 0, 1);
    Talk("對了，我派空性大師曾與少俠有約，要一起切磋“少林龍爪手”，這是他留給閣下的。", 70, 0);
    AddItem(44, 1);
    Talk("多謝。那空性大師人呢？", 0, 1);
    Talk("唉，空性神僧已經圓寂了。", 70, 0);
    Talk("什么！", 0, 1);
    Talk("空性大師在回少林途中，路遇幾個會大力金剛指功夫的僧人，結果力戰不敵。", 70, 0);
    if HaveItemBool(109) == true then goto label1 end;
        Talk("那大師是在何處遇害的？", 0, 1);
        Talk("應該是在萬安寺附近。我已派出人手打探，但至今消息全無。", 70, 0);
        Talk("玄慈方丈，我也一定會去一探究竟。", 0, 0);
        ModifyEvent(-2, -2, -2, -2, 515, -1, -1, -2, -2, -2, -2, -2, -2);
        if CheckEventID(17, -1) == true then goto label2 end;
            ModifyEvent(-2, 17, -2, -2, 874, -1, -1, -2, -2, -2, -2, -2, -2);
::label2::
            if CheckEventID(18, -1) == true then goto label3 end;
                ModifyEvent(-2, 18, -2, -2, 875, -1, -1, -2, -2, -2, -2, -2, -2);
::label3::
                if CheckEventID(19, -1) == true then goto label4 end;
                    ModifyEvent(-2, 19, -2, -2, 876, -1, -1, -2, -2, -2, -2, -2, -2);
::label4::
                    if CheckEventID(20, -1) == true then goto label5 end;
                        ModifyEvent(-2, 20, -2, -2, 877, -1, -1, -2, -2, -2, -2, -2, -2);
::label5::
                        if CheckEventID(21, -1) == true then goto label6 end;
                            ModifyEvent(-2, 21, -2, -2, 878, -1, -1, -2, -2, -2, -2, -2, -2);
::label6::
                            exit();
::label1::
                            Talk("是不是萬安寺的和尚？", 0, 1);
                            Talk("少俠怎會知道？", 70, 0);
                            Talk("我曾途經那里，教訓過幾個惡僧。他們像是朝廷的人，專門對付江湖中人。我已把那里的江湖朋友都救出來了，那些惡人也被我趕跑了。", 0, 1);
                            Talk("如此說，空性大師的血仇也已得報。少俠真是功德無量！", 70, 0);
                            ModifyEvent(-2, -2, -2, -2, 515, -1, -1, -2, -2, -2, -2, -2, -2);
                            if CheckEventID(17, -1) == true then goto label7 end;
                                ModifyEvent(-2, 17, -2, -2, 874, -1, -1, -2, -2, -2, -2, -2, -2);
::label7::
                                if CheckEventID(18, -1) == true then goto label8 end;
                                    ModifyEvent(-2, 18, -2, -2, 875, -1, -1, -2, -2, -2, -2, -2, -2);
::label8::
                                    if CheckEventID(19, -1) == true then goto label9 end;
                                        ModifyEvent(-2, 19, -2, -2, 876, -1, -1, -2, -2, -2, -2, -2, -2);
::label9::
                                        if CheckEventID(20, -1) == true then goto label10 end;
                                            ModifyEvent(-2, 20, -2, -2, 877, -1, -1, -2, -2, -2, -2, -2, -2);
::label10::
                                            if CheckEventID(21, -1) == true then goto label11 end;
                                                ModifyEvent(-2, 21, -2, -2, 878, -1, -1, -2, -2, -2, -2, -2, -2);
::label11::
                                                exit();
::label0::
                                                Talk("大師，我們是來向你借一樣東西的．", 139, 1);
                                                Talk("不知施主要跟老衲借什麼？", 70, 0);
                                                Talk("一份信件．", 139, 1);
                                                Talk("一份信件？", 70, 0);
                                                Talk("沒錯，一份信件．一份當年武林夙宿們共同草擬的信件．．．一份證明現在丐幫幫主喬峰并不是漢人，而是契丹人的信件．", 139, 1);
                                                Talk("你是誰！", 70, 0);
                                                Talk("在下姑蘇慕容復．", 139, 1);
                                                Talk("你是慕容復，你如何知道此事？", 70, 0);
                                                Talk("我自然知道．", 139, 1);
                                                Talk("是了，一定是那個人告訴你的．", 70, 0);
                                                Talk("慕容公子，這是怎麼回事？什麼漢人，契丹人的？   　　　　　　　　　　", 0, 1);
                                                Talk("你不知道吧，我看恐怕江湖上也沒幾個人會知道，原來我們丐幫現任的幫主喬峰喬大俠，并不是漢人，而是血腥屠殺漢人的契丹狗．當年這位玄慈方丈率領中原群俠，誤殺了一名契丹人．而那名契丹人留有一子，中原群俠因為愧疚想好好照顧他，就決定由少林寺私下扶養他長大，．．．後來那個孩子當上了丐幫幫主，他就是喬峰．可是呢，當年那些中原群俠又怕喬峰體內所流露的契丹性格，將來會爆發出來，危害到中原武林，於是就寫了一份信件，說明了喬峰的身份，一旦他野性暴露，就將他的身份揭發出來，讓中原群俠一起對付他，就像對付他爹一樣．所以呢，今天我們只要弄到這信件，就可讓喬峰羞愧的無地自容，兄弟你自然也能輕易地得到”天龍八部”了．", 139, 1);
                                                Talk("阿彌陀佛，阿彌陀佛！當年我們的確誤殺了喬峰他父親．如今他的兒子有這番成就，大仁大義，就是連漢人也比不上的，老衲是不會將那封信件交給你們的．", 70, 0);
                                                Talk("方丈話別說的這麼快．兄弟，接下來我會讓你知道帶我來的好處．方丈，你還記得”葉二娘”吧？還記得”紫云洞相會”之事還記得”喬婆婆接生”之事嗎？", 139, 1);
                                                Talk("你．．你．．你怎麼知．．知道的．．．", 70, 0);
                                                Talk("我知道的還很多，要不要我再講下去．", 139, 1);
                                                Talk("不要再講了．．．", 70, 0);
                                                Talk("那信件呢？", 139, 1);
                                                Talk("這．．．．．．唉！．．．你們拿去吧．", 70, 0);
                                                Talk("兄弟，得手了，我們去丐幫揭發喬峰吧．", 139, 1);
                                                Talk("阿彌陀佛，阿彌陀佛！施主得饒人處且饒人．", 70, 0);
                                                ModifyEvent(-2, -2, -2, -2, 512, -1, -1, -2, -2, -2, -2, -2, -2);
                                                AddItem(183, 1);
                                                AddMorality(-3);
                                                ModifyEvent(-2, 0, -2, -2, -1, -1, 514, -2, -2, -2, -2, -2, -2);
                                                ModifyEvent(-2, 1, -2, -2, -1, -1, 514, -2, -2, -2, -2, -2, -2);
                                                ModifyEvent(-2, 2, -2, -2, -1, -1, 514, -2, -2, -2, -2, -2, -2);
exit();
