Talk("你這小子，挺有兩下子的，過的了我的萬鱷潭，很好．咦！我看你手長足長，腦骨後禿，腰脅柔軟，跟我非常像，真是學武的奇才．快磕頭，求我收你為弟子．", 44, 0);
Talk("有沒有搞錯，看你呆頭呆腦的，還要我拜你為師．我看你拜我為師還差不多．", 0, 1);
Talk("你這小子，還真倔強．好，你若打的過我，我岳老二就拜你為師．否則，你就拜我為師．", 44, 0);
Talk("有我在你南海鱷神只能叫”岳老三”。", 56, 1);
Talk("是”岳老二”！", 44, 0);
Talk("吵夠了沒有？讓外人看笑話。", 71, 1);
Talk("小兄弟，算你倒霉。遇上我們“四大惡人”。", 14, 0);
if TryBattle(90) == true then goto label0 end;
    Dead();
    exit();
::label0::
    LightScence();
    Talk("媽的，打輸了就跑。真沒道義！", 44, 0);
    Talk("岳老三，你自己說過的話都忘了嗎？你說打輸我要拜我為師的，怎麼忘了呢？", 0, 1);
    Talk("拜就拜，我岳老二向來說話算話．你是我師父了．", 44, 0);
    ModifyEvent(-2, -2, -2, -2, 569, -1, -1, -2, -2, -2, -2, -2, -2);
    AddFame(3);
exit();
