Talk("公子急著想見令狐沖，你跟他是啥關系？", 25, 0);
Talk("關系？我們是一起喝酒的酒友！他已經身受重傷，你們還千里迢迢的把他從中原帶到云南？害他傷的更重怎麼辦?", 0, 1);
Talk("公子可以安心了，小女子就是受人所托來照顧令狐公子．", 25, 0);
Talk("是你，兄弟你怎麼也來到這里．", 35, 1);
Talk("知道你被抓來這里，所以，咦？面你面色怎麼好像比之前受的傷更嚴重．", 0, 0);
Talk("哀，事情是這樣．．．．．．所以我現在體內有六道不同的真氣，我完全沒辦法控制．", 35, 1);
Talk("藍教主，你還說你有好好照顧令狐兄弟，這不是把他害的更慘嗎?", 0, 0);
Talk("要怪就怪那些調皮搗蛋的桃谷六仙，如今能治好令狐沖的只有殺人名醫平一指了", 25, 0);
Talk("醫一人，殺一人，平一指會幫令狐沖治療?我記得平一指好像是日月神教的人啊．", 0, 1);
Talk("放心，治療令狐沖是圣姑交代下來的，平一指不敢違抗圣姑的命令的．", 25, 0);
if AskJoin () == true then goto label0 end;
    Talk("＜這個令狐沖看起來快掛了，還是別管他了，以免還要替他收屍＞啊啊！令狐兄，我突然想起還有重要的事要辦，我先失陪了．", 0, 0);
    exit();
::label0::
    if TeamIsFull() == false then goto label1 end;
        Talk("你的隊伍已滿，我無法加入．", 35, 0);
        exit();
::label1::
        Talk("不過令狐兄弟，你的傷勢真的不輕。我們看還我還是帶你上路去找那個平一指治療。", 0, 1);
        Talk("好，沒想到我令狐沖現在廢人一個，兄弟你竟然不嫌棄我。我令狐沖就跟你走！．", 35, 0);
        DarkScence();
        ModifyEvent(-2, -2, -2, -2, 617, -2, -2, -2, -2, -2, -2, -2, -2);
        LightScence();
        Join(35);
        AddFame(1);
exit();
