if InTeam(35) == false then goto label0 end;
    Talk("原來是向大哥，自從上次一別，不如今日就和大哥來痛飲一番．", 35, 0);
    Talk("我欠了你一命，雖是自己兄弟，你的傷居然連平一指也沒有辦法，總是心中不舒服，我非還你一條命不可。有一個地方，有個人定可治好你的傷。", 1, 0);
    Talk("向大哥別再為小弟勞心了，小弟的傷勢自己知道．", 35, 0);
    Talk("不不，在梅莊地底下有一個怪人，此人一定能化解你體內的多道真氣，住在梅莊的梅莊四友脾氣古怪，丹青生酷愛書畫，鶴筆翁鍾情書法，黑白子喜愛棋譜，黃鐘公寄情於音律，這幅畫你拿去，必能打動丹青生．", 1, 0);
    AddItem(180, 1);
    Talk("我想起來了，你不就是從皇宮盜寶後跑出來的那位老兄嗎?這幅畫就是你從宮中偷出來的吧!媽的，差點害死我", 0, 1);
    Talk("哈哈，別計較了，我知道你武功高強，那一些大內高手怎麼殺的了你，將這谿山行旅圖給丹青生看看，我不信他不會動心．", 1, 0);
    ModifyEvent(-2, -2, -2, -2, 626, -2, -2, -2, -2, -2, -2, -2, -2);
    SetSubMapLayerData(55, 1, 29, 46, 2050);
    SetSubMapLayerData(55, 1, 31, 46, 2054);
    SetSubMapLayerData(55, 1, 29, 47, 2048);
    SetSubMapLayerData(55, 1, 31, 47, 2052);
    SetSubMapLayerData(55, 1, 30, 47, 0);
    exit();
::label0::
    Talk("．．．．．．", 1, 0);
    Talk("靠腰!我只是．．．．", 0, 0);
exit();
