if isUsingItem(113) == true then goto label0 end;
    Talk("不要煩我！", 13, 0);
    exit();
::label0::
    if InTeam(9) == false then goto label1 end;
        Talk("義父雖得歸來，但雙目已瞎，『無恙』兩字，是說不上的了。明教的首領，豈能由失明之人擔任？明教我是會回去的，但不是是現在。", 13, 0);
        Talk("少了趙姑娘的計謀，行走江湖差點翻船．", 9, 1);
        Talk("奇怪，怎麼好像有一古怪的力量，讓我打不開寶箱。", 13, 0);
        if InTeam(39) == false then goto label2 end;
            Talk("玄燁？不就是當今皇上嗎?", 194, 1);
::label2::
            Talk("義父，明教代理教主張無忌，前來恭迎義父回歸光明頂接任教主之位．", 9, 1);
            Talk("無忌，你說什麼?甚麼明教教主？", 13, 0);
            Talk("謝老爺子，跟你說了罷，你那位義兒公子，乃是堂堂明教教主，你現在反倒是他的屬下。", 9, 1);
            Talk("義父，事情要從六大派圍攻光明頂講起，詳細經過是這樣的．．．．．．．．．", 13, 0);
            Talk("原來如此，屬下金毛獅王謝遜，參見教主。", 9, 1);
            Talk("義父不必多禮。陽教主遺命，請義父暫攝教主之位，孩兒正苦於不克負荷重任，天幸義父無恙歸來，實是本教之福。咱們回到中土之後，教主之位，是要請義父接任的。", 13, 0);
            ModifyEvent(-2, -2, -2, -2, -2, 65, -2, -2, -2, -2, -2, -2, -2);
            ModifyEvent(9, 0, 0, 0, -1, -1, 91, -1, -1, -1, -2, -2, -2);
            ModifyEvent(9, 1, 1, 1, -1, -1, -1, 5296, 5296, 5296, -2, -2, -2);
            ModifyEvent(9, 2, 1, 1, -1, -1, -1, 6092, 6092, 6092, -2, -2, -2);
            ModifyEvent(9, 3, 1, 1, -1, -1, -1, 6788, 6788, 6788, -2, -2, -2);
            ModifyEvent(9, 4, 1, 1, -1, -1, -1, 5892, 5892, 5892, -2, -2, -2);
            exit();
::label1::
            Talk("這是殷大哥的白虹劍，怎么會在你這里？", 13, 0);
            Talk("前輩就是金毛獅王謝遜吧．我找前輩好久了，你們明教的弟兄也正在找你．要你回去接下明教教主的職位．", 0, 1);
            Talk("你說什麼！明教長久以來四分五裂，這到底怎麼回事，怎麼會要我回去接下教主職位．", 13, 0);
            Talk("只要是六大派圍攻光明頂，你的義子張無忌救了明教，解了光明頂之危，目前六大派的人近期內決不敢造次．之後張無忌因形勢接下教主職位．事情的詳細經過是這樣的．．．．．．．．．", 0, 1);
            Talk("成崑這個老賊，不但與我有不共戴天之仇，更是我明教之大敵，我非殺了他不可．本以為拿了這把號令天下的屠龍刀，找出刀中的秘密後便能殺了他．但我鉆研了十幾年，始終無法了解此刀之神奇奧妙．唉！一日不解開此刀秘密，我就一日不離開冰火島．", 13, 0);
            Talk("前輩別擔心這麼多，還是先隨我回歸中原，大家一起想個法子．", 0, 1);
            Talk("別說了，你走吧．一日不殺掉成崑，我是不會回明教的．", 13, 0);
            ModifyEvent(-2, -2, -2, -2, -2, 65, -2, -2, -2, -2, -2, -2, -2);
            ModifyEvent(9, 0, 0, 0, -1, -1, 91, -1, -1, -1, -2, -2, -2);
            ModifyEvent(9, 1, 1, 1, -1, -1, -1, 5296, 5296, 5296, -2, -2, -2);
            ModifyEvent(9, 2, 1, 1, -1, -1, -1, 6092, 6092, 6092, -2, -2, -2);
            ModifyEvent(9, 3, 1, 1, -1, -1, -1, 6788, 6788, 6788, -2, -2, -2);
            ModifyEvent(9, 4, 1, 1, -1, -1, -1, 5892, 5892, 5892, -2, -2, -2);
exit();
