if HaveItemBool(164) == false then goto label0 end;
    AddItemWithoutHint(164, -1);
    Talk("干，燭火燒到我的四十二章經了．咦，怎麼書燒完後有六個數字還有一些字"鹿鼎山位置50 109"，這座標的位置不就是在那總督府，難道總督府蓋在在那鹿鼎山山上．", 0, 0);
    ModifyEvent(6, 0, -2, -2, 101, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(6, 1, -2, 0, -1, -1, -1, 8302, 8302, 8302, -2, -2, -2);
    ModifyEvent(6, 6, -2, -2, -1, -1, 102, -2, -2, -2, -2, -2, -2);
    ModifyEvent(6, 9, -2, 0, 101, -1, -1, 8300, 8300, 8300, -2, -2, -2);
    exit();
::label0::
    Talk("哇！好痛！這燭火還真燙．", 0, 1);
exit();
