if isUsingItem(174) == true then goto label0 end;
    exit();
::label0::
    AddItemWithoutHint(174, -1);
    Talk("我說大老爺，您這是干什麼來著，有什麼事盡管吩咐下來，小的一定給您照辦．", 106, 0);
    Talk("＜哼！我就知道這招有用＞我不要別的，只要你把知道的都說出來就行了．", 0, 1);
    Talk("我說大老爺！你要我說什麼呢？我又不是”南瓦北鄭”肚子里沒啥東西啊！", 106, 0);
    Talk("”南瓦北鄭”？他們是誰？", 0, 1);
    Talk("”南瓦北鄭”你都不知道，大老爺肯定是外地來的．”南瓦”指的是一位很有知識連老太婆都不放過的智者，江湖上傳言他上通天文，下知地理．武林中的事可說無所不知，無所不曉，因他居處嶺南，大家就尊稱他為”南瓦”而”北鄭”呢？據說他曾吃過自己的洨，平日瘋瘋癲癲的，一逢人便說他知道很多武林中的秘密．說也奇怪，聽過他話的人，有的人大罵他是胡說八道，有的人卻說他奇準無比．因為他住在塞北，行為又瘋瘋癲癲，所以大家就戲稱他為”北鄭”．", 106, 0);
    Talk("＜南瓦？北鄭？＞＜我看先去找南瓦問問看好了，看看有沒有什麼線索＞那麼南瓦住的地方怎麼走？", 0, 1);
    Talk("那簡單．出了本店後，順著小路一直往西南走就對了．這時間嘛，因為有一段路程要走，所以走久了可能會有點糊涂．不過還好，快到南瓦住處的時候，路上有一個特殊的圓形記號，蠻好認的．", 106, 0);
    Talk("小二哥呀！還說你肚子里沒啥東西，我看你是真人不露相！", 0, 1);
    Talk("那里！那里！這些都是道聽途說來的．干我們這一行的沒什麼，罩子放亮，耳朵張大就對了．不跟你多說了，我要去干活了，否則又會被老板訓．", 106, 0);
    ModifyEvent(-2, -2, -2, -2, 667, -1, -1, -2, -2, -2, -2, -2, -2);
exit();
