if HaveItemBool(78) == true then goto label0 end;
    exit();
::label0::
    if InTeam(30) == true then goto label1 end;
        exit();
::label1::
        if InTeam(35) == true then goto label2 end;
            exit();
::label2::
            SubMapViewFromTo(31, 52, 14, 17);
            SubMapViewFromTo(14, 17, 40, 17);
            SubMapViewFromTo(40, 17, 31, 52);
            Talk("這不是莫大先生嗎?看他看的這麼專心，還是別打擾他了．", 35, 0);
            Talk("沒想到石璧上居然刻著我派失傳已久的精妙劍法，此趟真是收獲不少．", 153, 4);
            Talk("真沒想到華山派的有鳳來儀，玉女十九式還能這麼使，真是大開眼界．", 35, 0);
            ModifyEvent(-2, -2, 0, -2, -1, -1, -1, -2, -2, -2, -2, -2, -2);
            ModifyEvent(-2, 1, 1, -2, 219, -2, -2, 5208, 5208, 5208, -2, -2, -2);
            ModifyEvent(-2, 2, 1, -2, 219, -2, -2, 5208, 5208, 5208, -2, -2, -2);
            ModifyEvent(-2, 3, 1, -2, 729, -2, -2, 5184, 5184, 5184, -2, -2, -2);
            ModifyEvent(-2, 4, 1, -2, 728, -2, -2, 5190, 5190, 5190, -2, -2, -2);
            ModifyEvent(-2, 7, 1, -2, 291, -2, -2, 5230, 5230, 5230, -2, -2, -2);
            ModifyEvent(-2, 8, 1, -2, 730, -2, -2, 5200, 5200, 5200, -2, -2, -2);
            ModifyEvent(-2, 9, 1, -2, 729, -2, -2, 5184, 5184, 5184, -2, -2, -2);
            ModifyEvent(-2, 10, 1, -2, 731, -2, -2, 5174, 5174, 5174, -2, -2, -2);
            ModifyEvent(-2, 11, 1, -2, 731, -2, -2, 5970, 5970, 5970, -2, -2, -2);
            ModifyEvent(-2, 14, 1, -2, 728, -2, -2, 5190, 5190, 5190, -2, -2, -2);
            ModifyEvent(-2, 15, 1, -2, 730, -2, -2, 5200, 5200, 5200, -2, -2, -2);
exit();
