if InTeam(35) == false then goto label0 end;
    Talk("奇怪，山洞里居然來了這麼多人。", 83, 0);
    Talk("是了，當日嵩山大會上，小師妹的五岳劍派劍法就是從這學來，想當然師父也是知道，這里定是師父開放給五岳劍派的人看的，咱們進去看看。", 35, 0);
    Talk("上面刻的萬花劍法，師尊從來沒有教過我們．", 83, 0);
    Talk("妙啊!有了祖師爺失傳的劍法，我們泰山派肯定能成為五岳劍派之首．", 35, 0);
    ModifyEvent(-2, 5, 0, -2, -2, -2, 732, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 6, -2, -2, -2, -2, -2, 5862, 5862, 5862, -2, -2, -2);
    ModifyEvent(-2, 12, -2, -2, -2, -2, -2, 5946, 5946, 5946, -2, -2, -2);
    ModifyEvent(-2, 13, -2, -2, -2, -2, -2, 6774, 6774, 6774, -2, -2, -2);
    exit();
::label0::
    Talk("奇怪，山洞里居然來了這麼多人。", 83, 0);
exit();
