Talk("回大人，我從這酸秀才身上也只搜出這一把啊!", 201, 5);
Talk("好吧，你可以滾了<看來還有一把的下落不明，看來應該是托付鴛刀給那秀才的女孩身上>", 0, 0);
Talk("謝大人!", 201, 5);
Talk("等等，快把鴛刀還給我!", 0, 0);
if TryBattle(265) == true then goto label0 end;
    Dead();
    exit();
::label0::
    ModifyEvent(-2, 17, 1, -2, 745, -2, -2, 5102, 5102, 5102, -2, -2, -2);
    LightScence();
    Talk("你就是把鴛刀放在那秀才身上的姑娘吧，我還正想說要怎麼找你，你卻自己找上門來，快把鴦刀交出來，省的我動手．", 0, 0);
    AddItem(188, 1);
    Talk("看你剛才三言兩語唬走那個大內高手，瞧你武功也不怎樣，不把鴛刀拿來我就要搶了．", 201, 5);
    ModifyEvent(-2, 18, -2, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 19, -2, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
exit();
