if InTeam(9) == true then goto label0 end;
    Talk("多謝少俠今日的幫助，從今以後，我明教定會好好約束門人．", 10, 0);
    exit();
::label0::
    Talk("不，她只要能迷昏周姑娘跟義父就夠了，沒想到她居然隱藏著如此惡毒的用心，看來全是為了得到倚天劍跟屠龍刀，不知周姑娘跟義父的性命是否無恙?", 10, 0);
    Talk("我還是覺得怪怪的。", 9, 1);
    Talk("母親曾經跟我說過，別相信漂亮的女人，真是一點都沒錯，趙敏啊趙敏，但教你撞在我手里，張無忌若再饒你，當真枉自為人了。", 10, 0);
    Talk("教主，不好了，少林寺廣發武林帖，說要辦屠獅大會，謝法王落入少林寺的手里了．", 9, 1);
    ModifyEvent(-2, -2, 1, -2, 88, -2, -2, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 105, 1, -2, 474, -2, -2, 5900, 5900, 5900, -2, -2, -2);
exit();
