Talk("好手段，你以為內力盡失我就會手下留情嗎?", 177, 1);
Talk("丁大哥，這小賊就交給我料理，順便試試你教我的神照經．", 37, 5);
if TryBattle(211) == true then goto label0 end;
    Dead();
    exit();
::label0::
    LightScence();
    Talk("失去內力還能使出好精妙的武功，讓我丁典會會你．", 177, 5);
    if TryBattle(222) == true then goto label1 end;
::label1::
        LightScence();
        Talk("<趁現在快溜>", 0, 0);
        Talk("金波旬花?凌退思對你使用金波旬花?看來你是真的被他抓近來，跟狄云兄弟一樣，我跟狄云兄弟還比你慘，還被穿了琵琶骨．", 177, 5);
        Talk("兄弟對不起，剛才罵了你小賊，沒想你也跟我狄云一樣是苦命人，被抓入獄．", 37, 1);
        Talk("我只是有點雖而已，對了，丁兄弟，你們武功這麼高，這牢房應該擋不住你吧．", 0, 0);
        Talk("不久前我神照經神功才大成，正打算逃出獄，你要是晚一點入獄就搭不上我們的順風車了，哈哈，等下逃出獄後分散來逃，才不會被凌退思一網打盡，讓我扭斷這個牢籠吧．", 177, 5);
        DarkScence();
        ModifyEvent(-2, 5, 1, -2, 998, -1, -1, 5408, 5408, 5408, -2, -2, -2);
        ModifyEvent(-2, 15, 0, -2, 997, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 16, 0, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
        ModifyEvent(-2, 17, 0, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
        ModifyEvent(-2, 18, 0, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
        ModifyEvent(-2, 19, 0, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
        LightScence();
exit();
